// Передача параметров (Руководство по программированию в C#) - описывает  варианты передачи даных в методы 
// Именованные и необязательные аргументы (Руководство по программированию на C# - описывает варианты формулировки имен для передачи в методы 
// Main() и аргументы командной строки - расказывает о тсратовой точке входа в програму и сложностями которые при этом могут возникнуть
// Методы (Руководство по программированию на C#) - описывает использование методов
// Наибольший общий делитель - статься про мат.функцию
// Рекурсия -определение, описание, изображение какого-либо объекта или процесса внутри самого этого объекта или процесса,
// то есть ситуация, когда объект является частью самого себя
// перегрузка методов - способ задавание методо в с 1дним именем для будущего удобного использования при некой неопределенности передаваемых значений
